#15, 15, 16, 16, 16, 16, 16, 16, 15, 17, 17, 17, 17, 19, 21, 21, 23, 25, 25, 26, 32 
#ეს არის თქვენი ჯგუფის წევრების ასაკები, 
#დავალება:
#შექმენით პროგრამა რომელიც გამოითვლის ჯგუფის საშუალო ასაკს. ასევე გამოითვალეთ ყველაზე ხშირად რომელი ასაკი გვხვდება


ages = [15, 15, 16, 16, 16, 16, 16, 16, 15, 17, 17, 17, 17, 19, 21, 21, 23, 25, 25, 26, 32 ]

print(sum(ages)//len(ages))

num = ages[0]  #თავდაპირველად ნუმს მივეცით მნიშვნელობა 0 რაც არის პირველი ინდექსი ორიგინალურ სიაში

for element in ages: 
    if ages.count(element) > ages.count(num):  #ნუმი რომელსაც მნიშველობა 15 მივეცი(ლისტის პირველი ინდექსი) მისი რაოდენობა ედარება სხვა ინდექსების რაოდენობაზე. თუ ელემენტი იქნება ნუმ მნიშვნელობაზე მეტი
        num = element #მაშინ ბოლოს ლუპების მერე ახალ მნიშვნელობას მივანიჭებ და ყველაზე მეტად გამეორებულ ინდექსს დავიტოვებ
print(num) 