# 1) შექმენი ცვლადი my_number და მიაწერე რიცხვი 10. დაბეჭდე ცვლადის მნიშვნელობა.

my_number = 10
print(my_number)

#2)შექმენი ცვლადი my_text და მიაწერე მას ტექსტი "Hello, World!". დაბეჭდე ცვლადის ტიპი.

my_text = "hello world"
print(type(my_text))

# 3)შექმენი ორი ცვლადი num1 და num2, და მიაწერე მათ 5 და 15. დაბეჭდე მათ ჯამი.

num1 = 5
num2 = 15
print(num1 + num2)

# 4)შექმენი ორი ცვლადი first_name და last_name და მიაწერე მათ შესაბამისი სახელები. დაბეჭდე ორივე ერთად.

first_name = "კესარია"
last_name = "ჩიჩუა"
print(first_name + " " + last_name)

# 5)შექმენი ცვლადი age და მიაწერე მას 8. შემდეგ შეცვალე მისი მნიშვნელობა 9-ზე და დაბეჭდე ახალი მნიშვნელობა.

age = 8
age = 9
print(age)

# 6) შექმენი ცვლადი, str_num და შეინახეთ “10”, მოცემული ცვლადი გადაიყვანეთ ინტეჯერში და შემდეგ გაამრავლეთ ექვსზე

str_num = "10"
num1 = int(str_num)
ans = num1 * 6
print(ans)

# 7) შექმენი ცვლადები num1 და num2, ამ ცვლადებში შეინახეთ: “10” და “5”, შემდეგ გადაიყვანეთ ინტეჯერებში და გადაამრავლეთ

num1 = "10"
num2 = "5"
num3 = int(num1)
num4 = int(num2)
print(str(num3) + " * " + str(num4) + " = " + str(num3 * num4))

# 8) შექმენით რამოდენიმე ცვლადი მინიმუმ 5 რომლებშიც შეინახავთ რიცხვებს შემდეგ კი დაბეჭდეთ მათი საშუალო არითმეტიკული

num1 = 3
num2 = 4
num3 = 5
num4 = 8
num5 = 9
num6 = 7
num7 = 10

print((num1 + num2 + num3 + num4 + num5 + num6 + num7) / 7)