// შექმენით ფუნქცია, რომელიც მიიღებს n რაოდენობის რიცხვს და დაბეჭდავს მათ ჯამს. ფუნქციას გამოძახებისას უნდა გადასცეთ მინიმუმ 5 არგუმენტი. პირველი და მეორე არგუმენტები შეინახეთ ცვლადებში და დაბეჭდეთ მათი ნამრავლი, ხოლო სხვა დანარჩენი rest ოპერატორის გამოყენებით ჩასვით სიაში და დაბეჭდეთ მათი ჯამი

const sumOfN = (one,two,...n)=>{
        let sume = 0
        let multiply = one * two
        for(const i of n){
            sume +=i
            }
            return {sum:sume,mult:multiply}
        }
        console.log(sumOfN(1,2,3,4,5))